Documents/ИзменениеСтоимостиАктива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеСтоимостиАктива</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенег</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиВалюты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипОперацииАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАктивов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенег</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиВалюты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипОперацииАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипОперацииАктивов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пополнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИзменениеСтоимостиАктива/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Если НоваяЦена < 0 Тогда
		Сообщить("Ошибка: Стоимость не может быть отрицательной!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// 2. Текущая стоимость актива в регистре
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.ТекущаяСтоимостьОстаток КАК ТекущаяСтоимость
	|ИЗ
	|	РегистрНакопления.ОстаткиАктивов.Остатки(&Момент, Актив = &Актив И Пользователь = &Пользователь) КАК Остатки";
	
	Запрос.УстановитьПараметр("Момент", МоментВремени());
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТекущаяСтоимостьВРегистре = 0;
	Если Выборка.Следующий() Тогда
		ТекущаяСтоимостьВРегистре = ?(Выборка.ТекущаяСтоимость = Неопределено, 0, Выборка.ТекущаяСтоимость);
	КонецЕсли;
	
	// 3. Дельта
	Разница = НоваяЦена - ТекущаяСтоимостьВРегистре;
	Если Разница = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// 4. Проверка средств ТОЛЬКО для пополнения
	Если ТипИзменения = Перечисления.ТипОперацииАктивов.Пополнение Тогда
		
		КодВалюты = СокрЛП(Валюта.КодВалюты);
		ОстатокСредств = 0;
		
		ЗапросОстатки = Новый Запрос;
		Если КодВалюты = "RUB" Тогда
			ЗапросОстатки.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(Остатки.СуммаОстаток), 0) КАК Остаток
			|ИЗ
			|	РегистрНакопления.ОстаткиДенег.Остатки(&Момент, Пользователь = &Пользователь) КАК Остатки";
		Иначе
			ЗапросОстатки.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(Остатки.СуммаОстаток), 0) КАК Остаток
			|ИЗ
			|	РегистрНакопления.ОстаткиВалюты.Остатки(&Момент, Пользователь = &Пользователь И Валюта = &Валюта) КАК Остатки";
			ЗапросОстатки.УстановитьПараметр("Валюта", Валюта);
		КонецЕсли;
		
		ЗапросОстатки.УстановитьПараметр("Момент", МоментВремени());
		ЗапросОстатки.УстановитьПараметр("Пользователь", Пользователь);
		
		ВыборкаОст = ЗапросОстатки.Выполнить().Выбрать();
		Если ВыборкаОст.Следующий() Тогда
			ОстатокСредств = ВыборкаОст.Остаток;
		КонецЕсли;
		
		Если Разница > ОстатокСредств Тогда
			Сообщить("Недостаточно средств для пополнения! Нужно: " + Разница + ", в наличии: " + ОстатокСредств);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	// 5. Движение по активу (есть всегда для Пополнение/Изъятие/Переоценка)
	Если ТипИзменения <> Перечисления.ТипОперацииАктивов.Доход Тогда
		Движения.ОстаткиАктивов.Записывать = Истина;
		ДвижениеАкт = Движения.ОстаткиАктивов.Добавить();
		ДвижениеАкт.Период = Дата;
		ДвижениеАкт.Актив = Актив;
		ДвижениеАкт.Пользователь = Пользователь;
		ДвижениеАкт.ВидДвижения = ?(Разница > 0, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		ДвижениеАкт.ТекущаяСтоимость = ?(Разница > 0, Разница, -Разница);
	КонецЕсли;
	
	// 6. Движения денег/валюты ТОЛЬКО для Пополнение и Изъятие
	Если ТипИзменения = Перечисления.ТипОперацииАктивов.Пополнение
		ИЛИ ТипИзменения = Перечисления.ТипОперацииАктивов.Изъятие Тогда
		
		СуммаДенег = ?(Разница > 0, Разница, -Разница);
		КодВалюты = СокрЛП(Валюта.КодВалюты);
		
		// Пополнение: деньги РАСХОД
		// Изъятие:    деньги ПРИХОД
		ВидДвиженияДенег = ?(Разница > 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
		
		Если КодВалюты = "RUB" Тогда
			Движения.ОстаткиДенег.Записывать = Истина;
			ДвижениеДеньги = Движения.ОстаткиДенег.Добавить();
			ДвижениеДеньги.Период = Дата;
			ДвижениеДеньги.Пользователь = Пользователь;
			ДвижениеДеньги.ВидДвижения = ВидДвиженияДенег;
			ДвижениеДеньги.Сумма = СуммаДенег;
		Иначе
			Движения.ОстаткиВалюты.Записывать = Истина;
			ДвижениеВал = Движения.ОстаткиВалюты.Добавить();
			ДвижениеВал.Период = Дата;
			ДвижениеВал.Пользователь = Пользователь;
			ДвижениеВал.Валюта = Валюта;
			ДвижениеВал.ВидДвижения = ВидДвиженияДенег;
			ДвижениеВал.Сумма = СуммаДенег;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры
